# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# n = int(input("Введите число равное количеству элементов в массиве: "))
# x = int(input("Введите число x, которое будем искать: "))
# count = 0 

# list = []
# for i in range(1, n+1):
#     list.append(i)
# print(list)

# for i in list:
#     if i == x:
#         count += 1
# print(count)





# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# n = int(input("Введите число равное количеству элементов в массиве: "))
# x = int(input("Введите число x: "))

# list = []
# for i in range(1, n+1):
#     list.append(i)
# print(list)

# min = abs(x - list[0])
# index = 0
# for i in range(1, n):
#     count = abs(x - list[i])
#     if count < min:
#         min = count
#         index = i
# print(f'Число {list[index]} в списке самое близкое по величине к числу {x}')





# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. 
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко; 
# D, G – 2 очка; 
# B, C, M, P – 3 очка; 
# F, H, V, W, Y – 4 очка; 
# K – 5 очков; 
# J, X – 8 очков; 
# Q, Z – 10 очков. 
# А русские буквы оцениваются так: 
# А, В, Е, И, Н, О, Р, С, Т – 1 очко; 
# Д, К, Л, М, П, У – 2 очка; 
# Б, Г, Ё, Ь, Я – 3 очка; 
# Й, Ы – 4 очка; 
# Ж, З, Х, Ц, Ч – 5 очков; 
# Ш, Э, Ю – 8 очков; 
# Ш, Э, Ю – 10 очков. 
# Напишите программу, которая вычисляет стоимость введенного пользователем слова. 
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.

eng = {1:'AEIOULNSTR', 2:'DG', 3:'BCMP', 4:'FHVWY', 5:'K', 8:'JX', 10:'QZ'}
rus = {1:'АВЕИНОРСТ', 2:'ДКЛМПУ', 3:'БГЁЬЯ', 4:'ЙЫ', 5:'ЖЗХЦЧ', 8:'ШЭЮ', 10:'ШЭЮ'}

n = abs(int(input('Введите 1, если ваше слово на английском языке или 0, если на русском: ')))
word = input("Введите слово: ").upper()

if n == 1:
	print('За ваше слово вы получаете', sum([k for i in word for k, v in eng.items() if i in v]), 'очков')
if n == 0:
	print('За ваше слово вы получаете', sum([k for i in word for k, v in rus.items() if i in v]), 'очков')