# Задача 2. Найдите сумму цифр трехзначного числа.

# num = int(input("Введите число: "))
# a = num % 10
# b = num // 10
# c = b % 10
# d = b // 10
# print(f"Сумма цирф в числе {num} равна {a + c + d} ")



# Задача 4. Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов,
# чем Петя и Сережа вместе?

# sum = int(input("Введите количество всех журавликов: "))

# a = sum // 3
# k = a * 2
# s = a // 2
# p = a // 2

# print(f"Катя сделала {k} журавликов, Сережа сделал {s} журавликов, Петя сделал {p} журавликов")
